In [1]:
# Q1. List any five functions of the pandas library with execution.
import pandas as pd

# create dataframe first

dict_data = {
    'Emp_id':['CR133',"CR134",'CR135'],
    'Emp_Name':['Johna','Harish','Bipin'],
    'Jop':['Software Developer','Software Eng.','Cloud Eng']
}

df = pd.DataFrame(dict_data)

In [6]:
# first Function
df.info() # it give all information fo df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Emp_id    3 non-null      object
 1   Emp_Name  3 non-null      object
 2   Jop       3 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [7]:
# Second Function
df.dtypes # it all column behavior

Emp_id      object
Emp_Name    object
Jop         object
dtype: object

In [8]:
# third function
df.index # it give range index of df

RangeIndex(start=0, stop=3, step=1)

In [9]:
# Four Function
df.columns # it give columns of df

Index(['Emp_id', 'Emp_Name', 'Jop'], dtype='object')

In [10]:
# Five Function
df.shape # it give tuble first index is row and second index column of df

(3, 3)

In [12]:
# Q2. rechange index value of df ,starts from 1 and increments by 2 for each row.

# create df

dict_data = {
    'A':['Apple',"Ant",'Airplane'],
    'B':['Banana','Beer','Boll'],
    'C':['Carret','Cat.','Cloth']
}

df = pd.DataFrame(data=dict_data)

In [13]:
df

          A       B       C
0     Apple  Banana  Carret
1       Ant    Beer    Cat.
2  Airplane    Boll   Cloth

In [14]:
df.reindex([i for i in range(1,df.shape[0]+1,2)])

     A     B     C
1  Ant  Beer  Cat.
3  NaN   NaN   NaN

In [15]:
# Q3.To sum of first three number of df

# create Dataframe

dict_value = {'Values':[10, 20, 30, 40, 50]}

df = pd.DataFrame(dict_value)

In [15]:
# first method
df['Values'].head(3).sum()

60

In [16]:
# Second method using iterrows()
sum =0
for i,j in df.iterrows():
    if i<3:
        sum +=j['Values']
        # print(i,"...............",j['Values'])
print(sum)

60

In [17]:
# Q4. To count words 

# create Dataframe

dict_data = {
    'Text':['Apple',"Ant",'Airplane','Banana','Beer','Boll','Carret','Cat.','Cloth']
}

df  = pd.DataFrame(data=dict_data)

# using apply function to count words

def count_words(text):
    text = text.split()
    return len(text)

df['Word_Count'] = df['Text'].apply(count_words)

In [18]:
df

       Text  Word_Count
0     Apple           1
1       Ant           1
2  Airplane           1
3    Banana           1
4      Beer           1
5      Boll           1
6    Carret           1
7      Cat.           1
8     Cloth           1

In [20]:
# Q5. How are DataFrame.size() and DataFrame.shape() different?

'''
DataFrame.size : Returns size of dataframe/series which is equivalent to total number of elements.
That is rows * columns.

DataFrame.shape: Returns tuple of shape (Rows, columns) of dataframe/series
'''

'\nDataFrame.size : Returns size of dataframe/series which is equivalent to total number of elements.\nThat is rows * columns.\n\nDataFrame.shape: Returns tuple of shape (Rows, columns) of dataframe/series\n'

In [19]:
# Q6. Which function of pandas do we use to read an excel file?

'''
we using pd.read_excel(file path).

using pd.read_ after underscore we use any file.
'''

'\nwe using pd.read_excel(file path).\n\nusing pd.read_ after underscore we use any file.\n'

In [21]:
# Q7 filter username from email id

# create dataframe

dict_data = {
    'Email':['john.doe@example.com','golu.rai@gmail.com','riya.kapoor@gmai.com']
}

df = pd.DataFrame(data=dict_data)

def return_user_name(user):
    user = user.split("@")
    return user[0]
df['Username'] = df['Email'].apply(return_user_name)

In [22]:
df

                  Email     Username
0  john.doe@example.com     john.doe
1    golu.rai@gmail.com     golu.rai
2  riya.kapoor@gmai.com  riya.kapoor

In [2]:
# Q8 comapare two column value and create new df

dict_data = {
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
}

df = pd.DataFrame(data=dict_data)

In [3]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [4]:
df_new = df[(df['A']>5) & (df['B']<10)]

In [5]:
df_new

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [6]:
# Q9. find Mean,Mediam,Std

dict_value = {'Values':[10, 20, 30, 40, 50]}

df = pd.DataFrame(data = dict_value)

In [7]:
df.Values.mean()

30.0

In [8]:
df.Values.median()

30.0

In [9]:
df.Values.std()

15.811388300841896

In [7]:
# Q.10
date = pd.date_range('2023-5-01',periods=12)
dict_data = {
    'Sales':[100,200,300,400,500,600,700,800,900,1000,880,1200],
    'Date':date
}

df = pd.DataFrame(data=dict_data)
df['Date'] = pd.to_datetime(df['Date'])

In [8]:
df

    Sales       Date
0     100 2023-05-01
1     200 2023-05-02
2     300 2023-05-03
3     400 2023-05-04
4     500 2023-05-05
5     600 2023-05-06
6     700 2023-05-07
7     800 2023-05-08
8     900 2023-05-09
9    1000 2023-05-10
10    880 2023-05-11
11   1200 2023-05-12

In [9]:
df['MovingAverage']=df.rolling(7).mean()

/tmp/ipykernel_1641/4172204698.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df['MovingAverage']=df.rolling(7).mean()

In [10]:
df

    Sales       Date  MovingAverage
0     100 2023-05-01            NaN
1     200 2023-05-02            NaN
2     300 2023-05-03            NaN
3     400 2023-05-04            NaN
4     500 2023-05-05            NaN
5     600 2023-05-06            NaN
6     700 2023-05-07     400.000000
7     800 2023-05-08     500.000000
8     900 2023-05-09     600.000000
9    1000 2023-05-10     700.000000
10    880 2023-05-11     768.571429
11   1200 2023-05-12     868.571429

In [2]:
# Q.11
date = pd.date_range(start='2023-01-01',end='2023-01-05')
df = pd.DataFrame({'Date':date})
df['Date'] = pd.to_datetime(df['Date'])

In [3]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [4]:
df['Weekday'] = df['Date'].dt.day_name()

In [5]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [11]:
# Q.12
import numpy as np

df = pd.DataFrame(np.random.randint(1,100,(50,3)))
df['Date'] = pd.date_range('2023-01-01',periods=50, freq='D')
df['Date'] = pd.to_datetime(df['Date'])

df = df.set_index(['Date'])
df.loc['2023-01-01':'2023-01-31']

             0   1   2
Date
2023-01-01  71  87  61
2023-01-02  70  12  19
2023-01-03  33  84  63
2023-01-04  17  92  69
2023-01-05   8  65   4
2023-01-06  91  84  54
2023-01-07  99  34  11
2023-01-08  82  16  47
2023-01-09  19  52  20
2023-01-10  65  74  68
2023-01-11  26  34   5
2023-01-12  27  46  56
2023-01-13  49  57  44
2023-01-14  70  37  77
2023-01-15  21  18  27
2023-01-16  71  42  57
2023-01-17  67  74  37
2023-01-18  25  21   6
2023-01-19  17   2  27
2023-01-20  43  96  73
2023-01-21   5  18  13
2023-01-22  66  24  15
2023-01-23  18  70  13
2023-01-24  90  75  24
2023-01-25  67  80  76
2023-01-26  76  67  37
2023-01-27  72  44   4
2023-01-28  89  40  54
2023-01-29  90  53  88
2023-01-30  87  21  52
2023-01-31  19  94  75

In [ ]:
# Q.13 To use the basic functions of pandas, what is the first and foremost necessary library that needs tobe imported?
'''
first we import pandas module
than second we use pd.read_fileExtention to read dataset
third we use Dataframe.info function to get all information about dataset

'''